[
    {
      "id": 1,
      "estate_title": "Deluxe King Room",
      "segment_name": "Luxury Room",
      "short_description": "The Deluxe King Room offers a peaceful retreat with modern furnishings, a private balcony, and a cozy sitting area perfect for relaxing after a busy day or romantic evening with your partner.",
      "long_description": "Our Deluxe King Room is a haven of comfort and elegance, featuring a plush king-sized bed, stylish interiors, and an expansive private balcony overlooking the skyline. The room includes a smart TV, a mini fridge, and high-speed Wi-Fi to ensure you stay connected. The elegant bathroom comes with complimentary toiletries and a rain shower. Whether you're visiting for business or leisure, this room is tailored to meet your every need with sophistication and warmth.",
      "description": "Spacious king-sized room with elegant interiors, private balcony, and skyline view.",
      "image": "https://i.ibb.co/SvcsYZ8/luxury-room-1.jpg",
      "price": "$250/night",
      "status": "rent",
      "area": "450 sq ft",
      "location": "5th Floor, Tower A",
      "facilities": ["Living Room", "Balcony", "Mini Fridge", "Smart TV"],
      "button_text": "View Property"
    },
    {
      "id": 2,
      "estate_title": "Executive Suite",
      "segment_name": "Luxury Suite",
      "short_description": "The Executive Suite provides a refined setting with a cozy lounge, dedicated workspace, and high-end amenities, making it ideal for business travelers or anyone who values comfort and productivity.",
      "long_description": "Designed with luxury and productivity in mind, the Executive Suite features a spacious layout that includes a private lounge area and a dedicated workstation. The suite’s interior is adorned with tasteful furnishings and calming tones, perfect for unwinding. The marble bathroom includes a deep soaking tub and walk-in shower. Enjoy complimentary breakfast, premium room service, and personalized concierge services. This suite combines the warmth of home with the polish of a luxury hotel experience.",
      "description": "A lavish suite with separate lounge area, workspace, and marble bathroom with jacuzzi.",
      "image": "https://i.ibb.co/YRy09nv/luxury-room-2.jpg",
      "price": "$420/night",
      "status": "rent",
      "area": "720 sq ft",
      "location": "7th Floor, Tower B",
      "facilities": ["Living Room", "Workspace", "Jacuzzi", "Room Service"],
      "button_text": "View Property"
    },
    {
      "id": 3,
      "estate_title": "Ocean View Room",
      "segment_name": "Luxury Room",
      "short_description": "Wake up to breathtaking views of the sea from this beautiful ocean-facing room that features a large glass balcony, designer furnishings, and a calming ambiance for a peaceful and relaxing stay.",
      "long_description": "The Ocean View Room is all about serenity and natural beauty. Floor-to-ceiling windows invite in the morning sun and offer uninterrupted views of the sparkling sea. The room includes a queen-sized bed, elegant seating, ambient lighting, and premium bath products. Whether you're sipping wine on the balcony or enjoying the comfort of the interiors, this room promises to rejuvenate your senses. Ideal for couples, solo travelers, or anyone who loves the ocean breeze.",
      "description": "Relax in a cozy room with panoramic sea views, cozy lounge corner, and premium amenities.",
      "image": "https://i.ibb.co/nrH1T2T/luxury-room-3.jpg",
      "price": "$300/night",
      "status": "rent",
      "area": "500 sq ft",
      "location": "6th Floor, Tower C",
      "facilities": ["Living Room", "Sea View", "Minibar", "Private Balcony"],
      "button_text": "View Property"
    },
    {
      "id": 4,
      "estate_title": "Presidential Suite",
      "segment_name": "Ultra Luxury",
      "short_description": "The Presidential Suite offers an unrivaled living experience with two grand bedrooms, a private terrace, a personal butler, and an opulent dining space to enjoy elite-level comfort and convenience.",
      "long_description": "Live like royalty in the Presidential Suite, our most luxurious and expansive accommodation. This suite spans over 1500 sq ft and includes two tastefully decorated bedrooms, a full living and dining room, and a massive terrace with panoramic city views. A private butler is available at your service, and the suite is equipped with top-tier appliances, handcrafted furniture, and premium bedding. Whether for a high-level executive stay or a lavish honeymoon, this suite promises unforgettable moments.",
      "description": "A premium experience with 2 bedrooms, private terrace, and personalized services.",
      "image": "https://i.ibb.co/bs1v3kF/luxury-room-4.jpg",
      "price": "$1200/night",
      "status": "rent",
      "area": "1500 sq ft",
      "location": "Penthouse Level, Main Building",
      "facilities": ["2 Bedrooms", "Terrace", "Private Butler", "Dining Area"],
      "button_text": "View Property"
    },
    {
      "id": 5,
      "estate_title": "Family Room",
      "segment_name": "Family Stay",
      "short_description": "Spacious and cozy, the Family Room is tailored for comfort and fun with multiple beds, a mini play zone, and in-room entertainment that keeps both adults and kids happily engaged.",
      "long_description": "Designed for families seeking a comfortable and enriching stay, the Family Room includes dual queen-sized beds, a children’s play area, and an entertainment system with family-friendly content. The layout offers privacy and togetherness at once, with thoughtful amenities like a kitchenette, microwave, and extra seating. Safety is ensured with secure furniture and child-safe fixtures. It’s the perfect base for family holidays, combining relaxation for parents and enjoyment for kids.",
      "description": "Perfect for families with multiple beds, play area for kids, and entertainment system.",
      "image": "https://i.ibb.co/8BSP32B/luxury-room-5.jpg",
      "price": "$350/night",
      "status": "rent",
      "area": "800 sq ft",
      "location": "4th Floor, Family Block",
      "facilities": ["Double Beds", "Play Area", "Kitchen", "Living Room"],
      "button_text": "View Property"
    },
    {
      "id": 6,
      "estate_title": "Honeymoon Suite",
      "segment_name": "Romantic Stay",
      "short_description": "The Honeymoon Suite is designed with romance in mind, offering an intimate escape with ambient lighting, a private hot tub, and special decor to celebrate your love in luxurious privacy.",
      "long_description": "Celebrate love in style in the Honeymoon Suite, where elegance meets intimacy. This suite features a cozy layout with soft lighting, a plush king-size bed, and a romantic atmosphere curated with floral decor and soothing colors. The private hot tub is perfect for relaxing evenings, while the balcony offers stargazing opportunities. Enjoy champagne on arrival, personalized room service, and late checkout to make your romantic getaway truly special and stress-free.",
      "description": "Designed for couples, with hot tub, mood lighting, and romantic decor.",
      "image": "https://i.ibb.co/YWJvbKm/luxury-room-6.jpg",
      "price": "$400/night",
      "status": "rent",
      "area": "600 sq ft",
      "location": "8th Floor, Honeymoon Wing",
      "facilities": ["Hot Tub", "Mood Lighting", "Mini Bar", "Romantic Decor"],
      "button_text": "View Property"
    }
  ]
  