[
    {
      "id": 1,
      "estate_title": "Sky Dine Experience",
      "segment_name": "Rooftop Restaurant",
      "short_description": "Elevate your evenings with our Sky Dine Experience, offering an open-air ambiance, candle-lit tables, and a panoramic cityscape that complements every bite with a touch of serenity and elegance.",
      "long_description": "The Sky Dine Experience is a signature offering of our rooftop restaurant where romance meets luxury. With a stunning 360° city view, ambient lighting, and carefully curated background music, it’s the perfect place for couples and special celebrations. Our gourmet chefs prepare a rotating seasonal menu using premium local and imported ingredients. Enjoy an extensive wine list, handcrafted cocktails, and impeccable table service for a night to remember.",
      "description": "Romantic rooftop dining with panoramic city views, fine cuisine, and a tranquil setting.",
      "image": "https://i.ibb.co/f8sk7bg/rooftop-1.jpg",
      "price": "$90/person",
      "status": "rent",
      "area": "1500 sq ft",
      "location": "Top Floor, Block A",
      "facilities": ["Open Air Dining", "Live Music", "Candle Light Setup"],
      "button_text": "View Property"
    },
    {
      "id": 2,
      "estate_title": "Sunset Lounge",
      "segment_name": "Rooftop Restaurant",
      "short_description": "The Sunset Lounge offers the perfect place to unwind as the sun dips below the skyline. Enjoy handcrafted drinks, premium snacks, and a cozy environment that invites you to linger longer.",
      "long_description": "Unwind after a long day at the Sunset Lounge, where golden-hour vibes, plush seating, and signature cocktails define your evening. The lounge is perfect for casual meetups, dates, or solo relaxation. With live acoustic performances on weekends and a diverse tapas menu, it’s one of the most loved rooftop spots in the city. A fire pit corner and cozy throws ensure comfort even in the cooler evenings.",
      "description": "Chill spot for sunsets, drinks, and acoustic music under the open sky.",
      "image": "https://i.ibb.co/0fpWzHq/rooftop-2.jpg",
      "price": "$40/person",
      "status": "rent",
      "area": "1200 sq ft",
      "location": "Rooftop, Lounge Deck",
      "facilities": ["Firepit", "Bar Service", "Live Performances"],
      "button_text": "View Property"
    },
    {
      "id": 3,
      "estate_title": "Chef’s Table",
      "segment_name": "Rooftop Restaurant",
      "short_description": "For true culinary explorers, the Chef’s Table offers an exclusive dining experience with a custom tasting menu, direct interaction with the chef, and a behind-the-scenes view of the gourmet preparation process.",
      "long_description": "Step into a one-of-a-kind rooftop gastronomic journey at the Chef’s Table. Seating only 8 guests per evening, this intimate dining area is curated for food lovers and connoisseurs. Enjoy a multi-course tasting menu crafted with fresh, seasonal ingredients. Interact with our head chef as he shares culinary stories and techniques behind each plate. This elevated dining experience is perfect for anniversaries, proposals, and gourmet enthusiasts.",
      "description": "Private dining with curated tasting menus and chef interaction for food lovers.",
      "image": "https://i.ibb.co/9W5HKWy/rooftop-3.jpg",
      "price": "$150/person",
      "status": "rent",
      "area": "400 sq ft",
      "location": "Rooftop, Private Section",
      "facilities": ["Custom Menus", "Chef Interaction", "Exclusive Seating"],
      "button_text": "View Property"
    },
    {
      "id": 4,
      "estate_title": "Starlight Garden",
      "segment_name": "Rooftop Restaurant",
      "short_description": "Dine under a blanket of stars in the Starlight Garden, surrounded by greenery and string lights that create a magical setting for dinners with friends, family, or loved ones.",
      "long_description": "Escape the city buzz in our rooftop Starlight Garden—a peaceful hideaway lined with lush plants, flower beds, and romantic lighting. This area is ideal for intimate group dinners, proposal setups, and quiet moments. Our menu here includes organic options, artisanal drinks, and vegan-friendly platters. The garden offers an escape into a peaceful oasis with the convenience of a world-class kitchen just a step away.",
      "description": "Garden-inspired rooftop space with greenery, fairy lights, and healthy menus.",
      "image": "https://i.ibb.co/N7K9qTC/rooftop-4.jpg",
      "price": "$60/person",
      "status": "rent",
      "area": "1000 sq ft",
      "location": "Terrace Zone, Block B",
      "facilities": ["Garden Setup", "Vegan Menu", "Ambient Lighting"],
      "button_text": "View Property"
    },
    {
      "id": 5,
      "estate_title": "Rooftop Buffet",
      "segment_name": "Rooftop Restaurant",
      "short_description": "Indulge in a rich variety of global cuisines at our Rooftop Buffet, featuring live stations, grill counters, and unlimited dessert options under the sky-lit canopy for a vibrant dining affair.",
      "long_description": "The Rooftop Buffet is perfect for foodies looking for variety and volume. Featuring a rotating spread of international dishes, live counters for pasta, BBQ, and sushi, and a central dessert island, this is one of the most interactive and fun dining options on the rooftop. Seating is arranged to accommodate large groups, and themed buffet nights are held every weekend. A perfect blend of food, fun, and open-air freedom.",
      "description": "All-you-can-eat buffet with live grill stations and diverse cuisines under the stars.",
      "image": "https://i.ibb.co/cYdmwwc/rooftop-5.jpg",
      "price": "$75/person",
      "status": "rent",
      "area": "1800 sq ft",
      "location": "Main Rooftop Hall",
      "facilities": ["Buffet", "Live Grill", "Dessert Island"],
      "button_text": "View Property"
    },
    {
      "id": 6,
      "estate_title": "Romantic Dome Dining",
      "segment_name": "Rooftop Restaurant",
      "short_description": "Enjoy a private date night in a transparent rooftop dome, surrounded by stars, candlelight, and curated music for a dreamy and unforgettable dining experience with your special someone.",
      "long_description": "Romantic Dome Dining is crafted for couples who want an ultra-private and atmospheric dinner experience. Each transparent dome is climate-controlled and comes with personalized decor, including rose petals, candle stands, and soft music. Choose from our couple’s set menus or customize a romantic surprise package. Domes are limited and available via pre-booking only, offering a luxurious blend of intimacy and elegance with rooftop charm.",
      "description": "Private dining domes with climate control, candlelight, and custom set menus for couples.",
      "image": "https://i.ibb.co/FYrfVNm/rooftop-6.jpg",
      "price": "$180/couple",
      "status": "rent",
      "area": "300 sq ft",
      "location": "Sky Deck Zone",
      "facilities": ["Private Dome", "Romantic Decor", "Couple Set Menu"],
      "button_text": "View Property"
    }
  ]
  